const popularData = [
  {
    "id": '1',
    "title":"الليزي كيك",
    "image": "https://www.taabkh.com/files/styles/recipe/public/recipe/2021/01/Lazy-Cake.jpg",
    "info": [
     {
      "name": "وقت التحضير : 15 دقيقة"
     },
     {
      "name": "وقت الطبخ: 0 دقيقة"
     },
     {
      "name": "الكمية : 6 شخص | أشخاص"
     }
    ],
    "info2": [
     {
      "name": "عبوة كاملة من الأولكر السادة أو بسكويت الدايجستيف"
     },
     {
      "name": "علبة ونصف من الحليب المكثف المحلى."
     },
     {
      "name": "خمس ملاعق كبيرة من مسحوق الكاكاو السادة."
     }
    ],
    "prepare": [
     {
      "name": "في وعاء عميق، يوضع البسكويت ثم نكسره باليدين لقطع متوسطة الحجم."
     },
     {
      "name": "يضاف الحليب المكثف المحلى في وعاء الخلاط الكهربائي، ثم يضاف إليه الكاكاو ويتم خفق المكونات جيدًا حتى تتجانس."
     },
     {
      "name": "نضيف قطع البسكويت إلى خليط الحليب والكاكاو، ثم نحرك المكونات جيدًا حتى يتشرب البسكويت خليط الحليب والكاكاو."
     },
     {
      "name": "نأخذ قطعة قصدير كبيرة ونفردها على سطح صلب، ثم نضع كمية مناسبة من خليط البسكويت في المنتصف."
     },
     {
      "name": "نلف القصدير على شكل رول ونضغط عليه جيدًا حتى يتماسك."
     },
     {
      "name": "نضع الليزي كيك بالفريزر، ونتركه ليلة كاملة، ثم نخرجه من الفريزر قبل تقديمه بساعة حتى يسهل تقطيعه."
     },
     {
      "name": "نقطع الليزي كيك على شكل حلقات، ثم نزينه بالسكر البودرة أو جوز الهند المبشور، ونقدمه مباشرة."
     }
    ]
   },
   {
    "id": '2',
    "title":"كرات بقايا الكيك",
    "image": "https://www.taabkh.com/files/styles/recipe/public/recipe/2021/01/Leftover-cake-balls.jpg",
    "info": [
     {
      "name": "وقت التحضير : 20 دقيقة"
     },
     {
      "name": "وقت الطبخ: 5 دقيقة"
     },
     {
      "name": "الكمية : 6 شخص | أشخاص"
     }
    ],
    "info2": [
     {
      "name": "أصبع زبدة"
     },
     {
      "name": "5 أكواب من بقايا الكيك المفتتة"
     },
     {
      "name": "شوكولاته"
     },
     {
      "name": "مكسرات (حسب الرغبة)"
     },
     {
      "name": "جوز هند للتزيين (حسب الرغبة)"
     }
    ],
    "prepare": [
     {
      "name": "قومي بإذابة الزبدة دون أن تسخن."
     },
     {
      "name": "في وعاء عميق ضعي بقايا الكيك وأضيفي إليه الزبدة وادعكي الخليط بيديك حتى تتوزع الزبدة على كل الكمية."
     },
     {
      "name": "قومي بتشكيل كرات متساوية الحجم ومتماسكة من الكيك والزبدة."
     },
     {
      "name": "ضعي كرات الكيك في الثلاجة لمدة ساعة كاملة حتى تتماسك."
     },
     {
      "name": "في هذه الأثناء حضري صوص التزيين إما بتغطيسها بالشوكولاته أو برشّ بعضٍ من السكر الملوَّن والمكسرات أو جوز الهند."
     },
     {
      "name": "اتركي صوص تتماسك على الكرات، ثم يمكنك تقديم كرات الكيك المصنوع من بقايا الكيك إلى جانب القهوة، الشاي أو مختلف العصائر."
     }
    ]
   },
   {
    "id": '3',
    "title":" حلا التراميسو في 10 دقائق",
    "image": "https://www.taabkh.com/files/styles/recipe/public/recipe/2021/01/Tramisu-desserts.jpg",
    "info": [
     {
      "name": "وقت التحضير : 10 دقيقة"
     },
     {
      "name": "وقت الطبخ: 0 دقيقة"
     },
     {
      "name": "الكمية : 8 شخص | أشخاص"
     }
    ],
    "info2": [
     {
      "name": "2 علبة بسكويت الشاي"
     },
     {
      "name": "2 ملعقة صغيرة نسكافيه"
     },
     {
      "name": "1 علبة مكثف محلى"
     },
     {
      "name": "1 كيس كريمة مخفوقة"
     },
     {
      "name": "نصف كوب ماء ساخن"
     },
     {
      "name": "بودرة كاكاو (حسب الحاجة)"
     }
    ],
    "prepare": [
     {
      "name": "في وعاء صغير و واسع الفتحة، امزجي النسكافيه مع الماء ثم اغمري فيه قطع البسكويت واحدة تلو الأخرى ثم رصي نصف كمية البسكويت في الصينية."
     },
     {
      "name": "في وعاء آخر، اخفقي الكريمة مع المكثف المحلى حتى يتجانس الخليط."
     },
     {
      "name": "افردي طبقة من الكريمة على البسكويت ثم ضعي طبقة أخرى من البسكويت المنقوع في القهوة ويمكنك إضافة عدة طبقات إذا أردت."
     },
     {
      "name": "انثري على السطح بودرة الكاكاو وضعي التراميسو في الثلاجة لثلاث ساعات حتى يبرد ثم يقدم."
     }
    ]
   },
   {
    "id": '4',
    "title":"كيكة التوفي",
    "image": "https://www.taabkh.com/files/styles/recipe/public/recipe/2021/01/Toffee-cake.jpg",
    "info": [
     {
      "name": "وقت التحضير : 20 دقيقة"
     },
     {
      "name": "وقت الطبخ: 25 دقيقة"
     },
     {
      "name": "الكمية : 5 شخص | أشخاص"
     }
    ],
    "info2": [
     {
      "name": "3 بيض"
     },
     {
      "name": "1 كوب سكر"
     },
     {
      "name": "1 كوب زيت نباتي"
     },
     {
      "name": "1 معلقة صغيرة فانيليا"
     },
     {
      "name": "2 كوب حليب بودرة"
     },
     {
      "name": "1 معلقة صغيرة باكينج باودر"
     },
     {
      "name": "1 كوب سكر (لتحضير التوفي)"
     },
     {
      "name": "1 علبة قشطة"
     },
     {
      "name": "جوز مجروش (حسب الرغبة)"
     }
    ],
    "prepare": [
     {
      "name": "في مقلاة على النار، ضعي الحليب بودرة وقلبي جيدا حتى يصبح إلى اللون الذهبي."
     },
     {
      "name": "في وعاء، اخلطي البيض، السكر، الزيت النباتي، الفانيليا والباكينج باودر ثم اضيفي الحليب المحمص واخلطيه جيدا حتى تتجانس المكونات."
     },
     {
      "name": "اسكبي عجينة الكيك في صينية الفرن ثم ادخليها الفرن."
     },
     {
      "name": "ضعي السكر في وعاء على النار وحرّكيه حتى يذوب ثم أضيفي القشطة وحرّكي المزيج جيدًا."
     },
     {
      "name": "أخرجي الكيك من الفرن ثم اتركيه جاباً حتى يبرد."
     },
     {
      "name": "ادهني الوجه بصلصة التوفي و أضيفي الجوز المجروش على الوجه ثم ادخليها الثلاجة ليبرد."
     }
    ]
   },
   {
    "id": '5',
    "title":"كيكة الليمون بالصوص",
    "image": "https://www.taabkh.com/files/styles/recipe/public/recipe/2021/01/Lemon-cake-with-sauce.jpg",
    "info": [
     {
      "name": "وقت التحضير : 20 دقيقة"
     },
     {
      "name": "وقت الطبخ: 40 دقيقة"
     },
     {
      "name": "الكمية : 6 شخص | أشخاص"
     }
    ],
    "info2": [
     {
      "name": "2 كوب إلا ربع من الدقيق"
     },
     {
      "name": "2 ملعقة صغيرة من البيكنج بودر"
     },
     {
      "name": "4 بيضات"
     },
     {
      "name": "2 ملعقة صغيرة من الفانيليا"
     },
     {
      "name": "ملعقة كبيرة بشر ليمون"
     },
     {
      "name": "ربع كوب من الزبدة السائلة"
     },
     {
      "name": "ربع كوب من الزيت"
     },
     {
      "name": "رشة ملح"
     },
     {
      "name": "ربع كوب من عصير الليمون"
     },
     {
      "name": "كوب إلا ربع من السكر"
     },
     {
      "name": "مقادير صوص الليمون"
     },
     {
      "name": "نصف كوب من الماء"
     },
     {
      "name": "ملعقة كبيرة عصير ليمون"
     },
     {
      "name": "كوب من السكر الناعم"
     },
     {
      "name": "نصف ملعقة صغيرة من الفانيليا"
     }
    ],
    "prepare": [
     {
      "name": "في وعاء عميق، نخفق البيض والسكر والفانيليا جيدا حتى يذوب السكر ونحصل على قوام هش."
     },
     {
      "name": "نضيف الزيت والزبدة وبشر الليمون ونستمر في الخفق لمدة 5 دقائق تقريبا."
     },
     {
      "name": "اخلطي الدقيق والبيكنج بودر والملح، وأضيفيها إلى خليط البيض وعصير الليمون بالتدريج مع الاستمرار بالخفق."
     },
     {
      "name": "حضري قالب الكيك ويتم دهنه بالزبدة ورشه بالدقيق ويصب به الخليط."
     },
     {
      "name": "ضعي القالب في الفرن متوسط الحرارة على درجة حرارة 180 على الرف الأوسط لمدة 40 تقريبا حتى تمام النضج."
     },
     {
      "name": "لتحضير الصوص: نضع السكر والماء على النار حتى بداية الغليان ونضيف إليها عصير الليمون والفانيليا، ونقلب حتى يتماسك القوام قليلا."
     },
     {
      "name": "بعد نضج الكيك، نقلبه على شبك معدني، ويتم وضع ثقوب رفيعة على الكيك وهو ساخن"
     },
     {
      "name": "يتم دهن كيكة الليمون بالصوص وهي ساخنة فور خروجها من الفرن، ويمكنك نثر بشر الليمون على السطح للزينة حسب الرغبة، ويترك حتى يبرد ويقدم إلى جانب الشاي والقهوة."
     }
    ]
   }
  ];
  
  export default popularData;